const Main = () => {
    return <div>
        <h1>YouTube</h1>
        <article>
          YouTube был создан в феврале 2005 года Стивом Ченом, Чадом Хёрдли и Джаведом Каримом — тремя бывшими работниками PayPal в Сан-Бруно, Калифорния. Они использовали технологию Flash Video, позволяющую получить относительно хорошее качество записи при небольшом объёме передаваемых данных.

Самое первое видео — 19-секундный ролик любительской съёмки Джаведа Карима в зоопарке Сан-Диего — было размещено на YouTube 23 апреля 2005 года в 20:27 по местному времени.

В ноябре 2006 года была завершена покупка YouTube компанией Google за 1,65 миллиарда долларов. До покупки YouTube у Google был сервис схожей направленности — Google Видео. Представители Google не стали закрывать его, а использовали его как место поиска видео по всем видеохостинговым сайтам. В настоящее время поиск Google Video включает и YouTube.

9 июля 2010 года Google объявила о поддержке кинематографического формата IMAX на YouTube.


Офис компании в Калифорнии
2 декабря 2011 года YouTube запустил новую версию интерфейса сайта, видео с каналов отображаются в центральной колонке на главной странице, похожие на ленты новостей на сайтах социальных сетей. В то же время новая версия логотипа YouTube была введена в более тёмный оттенок красного, первое изменение в дизайне с октября 2006 года.

В феврале 2013 года был обновлён дизайн каналов.
В августе 2013 года появилась строка вверху страницы, которая показывала статус загрузки видео.

В октябре 2014 года YouTube начал поддерживать видео с частотой 48 и 60 кадров в секунду.

27 января 2015 года YouTube перешёл на HTML5-плеер, заменив стандартный Flash.

23 февраля 2015 YouTube запустил приложение для детей под названием «YouTube Kids».

16 марта 2015 YouTube запустил новый сервис «Подсказки», заменяющий аннотации в видео на мобильных устройствах.

В июле 2015 приложение для Android обновилось до версии 10.28. Наиболее важное изменение в нём — видео, снятые вертикально, в полноэкранном режиме автоматически переворачиваются на 90 градусов и занимают весь экран.


Логотип YouTube с 2015 года по 2017 год
28 октября 2015 YouTube запустил платную подписку на сервис YouTube Red. Платный сервис позволил пользователям отключать показ прероллов и рекламу. Стала доступной функция сохранения видеороликов и их воспроизведения при отсутствии подключения к интернету. Помимо этого, с приобретением подписки появился доступ к контенту, не доступному обычным пользователям. 18 июня 2018 года YouTube осуществил ребрендинг сервиса, который теперь известен как YouTube Premium.

В начале 2016 года у пользователей появилась возможность попробовать дизайн Material Design, но полного редизайна сайт не получил.
Осенью 2016 года на YouTube появилась возможность добавлять конечные заставки для видео, однако, они оказались несовместимы с аннотациями.

В ноябре 2016 года в России официально стал доступен сервис YouTube Gaming  (англ.)рус., предназначенный для более удобного поиска игрового контента. В конце мая 2019 года Google прекратил поддержку сервиса, впоследствии упразднив его полностью, функции видеостриминговой платформы были перенесены из отдельного приложения на основной сервис YouTube.

В 2017 году YouTube сообщил о запуске собственной телевизионной платформы YouTube TV, которая появится на территории США в ближайшие несколько месяцев. Сервис будет работать в онлайн-режиме и пользователям можно будет не приобретать подписку на спутниковое или кабельное телевидение — за 34.99 $ в месяц подписчики получат онлайн-доступ к основным вещательным сетям и кабельным каналам. В пакет также войдёт услуга YouTube Red, которая позволяет смотреть ролики без рекламы. За дополнительную плату можно будет подключить футбольное телевидение и премиум-канал Showtime.

В августе 2017 года в мобильное приложение YouTube встроили раздел личных уведомлений, позволяющий пользователям делиться видео и впечатлениями от просмотренных роликов. Новая функциональность также позволяет создавать групповые чаты до 30 человек.

29 августа 2017 года YouTube обновил дизайн сайта и приложений, а также, впервые с 2005 года, изменил логотип. Новый дизайн выполнен в соответствии с придуманной в Google концепцией Material Design. Кроме этого, теперь в мобильной версии приложения вертикальные и квадратные видео будут адаптироваться к размеру экрана, а в версии для настольных компьютеров также появилась возможность выбрать тёмную тему оформления.

В январе 2018 года YouTube объявил об изменениях в мобильной версии видеосервиса для Android. Пользователей ожидали режим инкогнито, ночная тема и возможность пролистывать рекламу свайпом вправо. Предполагалось, что изменения вступят в силу после установки версии прошивки 13.1. В июле 2018 года пользователям Android стал доступен ночной режим (при котором фон приложения становился тёмно-серым, а текст — белым) и режим инкогнито.

В мае 2018 года YouTube добавил музыкальные хит-парады для 44 стран с наиболее популярными песнями, клипами и исполнителями.

В июне 2018 года YouTube предоставил владельцам каналов, набравших более 30 тысяч подписчиков, возможность вводить платную подписку. Игровые каналы могут вводить платную подписку от одной тысячи пользователей, кроме того, неигровые каналы могут вводить эту услугу и при меньшем количестве подписчиков, при выполнении отдельных условий, оговариваемых YouTub’ом. Помимо прямого увеличения доходов видеоблогеров, авторы каналов получили возможность разделять контент на общедоступный и предназначенный только для платных подписчиков, предлагать пользователям платных подписок расширенные коллекции эмодзи и прочие подобные бонусы.

В январе 2019 года администрация YouTube обновила пользовательское соглашение. С этого момента на хостинге запрещено выкладывать ролики, на которых люди могли умереть или получить серьёзные травмы в ходе различных испытаний.

В марте 2019 года в руководстве YouTube задумались о создании собственного интерактивного сервиса, вдохновлённые успехом аналогичного проекта Netflix. Спецподразделение возглавил Бен Реллис, который до этого 8 лет трудился в YouTube над созданием комедийного контента. До запуска полноценного формата YouTube уже имел опыт размещения интерактивной рекламы, на которой имел возможность оценить технические возможности и интерес зрительской аудитории к подобному контенту.

В марте 2019 года разработчиками видеохостинга было объявлено о введении в действие нового сервиса, способного уменьшить количество сфальсифицированных записей. Публикуемые материалы будут проверяться в автоматическом режиме. Тестирование планируется провести на территории Индии, и после успешных испытаний обновление будет возможно в других странах.

В сентября 2020 года YouTube объявил о запуске сервиса коротких видео «Youtube Shorts». Первончально его функционал был доступен только в Индии, где несколько месяцев назад прекратил свою работу TikTok.

В январе 2020 года YouTube ввёл новые ограничения на «взрослый контент» и «детский контент» для соблюдения закона COPPA. По новым правилам существенные изменения коснулись (в сторону уменьшения или полного снятия монетизации и т. п.) каналов для детской аудитории и/или с детьми-контентмейкерами.

В июле 2021 года YouTube изменил цвет кнопок «Главная», «В тренде», «Подписки», «Библиотека» и «История» на чёрно-белый вариант.

В августе 2021 года YouTube начал тестировать более дешёвый вариант премиум-подписки «Premium Lite». Она позволяла просматривать видео без рекламы, при этом другие продвинутые функции были недоступны. С 25 октября 2023 года сервис решил отказаться от этой подписки.

7 октября 2021 года YouTube начал тестировать функцию выделения наиболее интересных пользователям фрагментов в видео. Участники эксперимента увидят график частоты просмотра фрагментов над красной полосой во время прокрутки видео. Пока что функция доступна ограниченному количеству пользователей.

В марте 2021 года начала поступать информация о том, что YouTube будет скрывать счётчик дизлайков под видеороликами. Осенью того же года обновление вступило в силу.

В августе 2022 года YouTube обновил дизайн на более современный. Теперь многие значки и кнопки закруглены по краям.

16 февраля 2023 года на роль генерального директора вступил Нил Мохан, тем самым заменив ушедшую Сьюзен Воджитски.

В сентябре 2023 года YouTube объявил о запуске приложения для редактирования видео на смартфоне «YouTube Create».

На сайте YouTube.com пользователи могут загружать видео в нескольких распространённых форматах, в том числе .mpeg и .avi. YouTube автоматически конвертирует их в .mp4 с использованием несвободного (патентованного) кодека H.264, а также кодеков для формата WebM, и делает их доступными для просмотра в онлайн.
          </article>
    </div>
}

export default Main